*** src/lib.rs:1198:25: replace > with == in decrypt_bounded

*** mutation diff:
--- src/lib.rs
+++ replace > with == in decrypt_bounded
@@ -1190,17 +1190,17 @@
 pub fn decrypt_bounded(
     key: &[u8; 32],
     nonce: &[u8; NONCE_LEN],
     aad: &[u8],
     ciphertext: &[u8],
     tag: &[u8; TAG_LEN],
     max_len: usize,
 ) -> Result<Plaintext, Error> {
-    if ciphertext.len() > max_len {
+    if ciphertext.len() == /* ~ changed by cargo-mutants ~ */ max_len {
         return Err(Error::MessageTooLong);
     }
     decrypt(key, nonce, aad, ciphertext, tag)
 }
 
 /// Decrypt `buffer` in place, verifying the detached tag.
 ///
 /// On failure the buffer is zeroized, so unverified plaintext is never left in

*** result: Success
