*** src/lib.rs:1037:8: delete ! in accept_or_reject

*** mutation diff:
--- src/lib.rs
+++ delete ! in accept_or_reject
@@ -1029,17 +1029,17 @@
 // wasted computing a second one.
 #[inline(never)]
 fn accept_or_reject(
     gate0: subtle::Choice,
     gate1: subtle::Choice,
     buffer: &mut [u8],
     out: &mut Result<(), Error>,
 ) {
-    if !bool::from(gate0) {
+    if  /* ~ changed by cargo-mutants ~ */bool::from(gate0) {
         zeroize_slice(buffer);
         *out = Err(Error::AuthenticationFailed);
         return;
     }
 
     // Fault-injection hardening (the `hardened` feature, on by default): a second
     // *recomputed*
     // check with its own branch, so a single skipped instruction reaches this gate

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (811198) panicked at tests/decision.rs:26:51:
called `Result::unwrap()` on an `Err` value: AuthenticationFailed

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
