*** src/lib.rs:1031:5: replace accept_or_reject with ()

*** mutation diff:
--- src/lib.rs
+++ replace accept_or_reject with ()
@@ -1023,43 +1023,17 @@
 // wasted computing a second one.
 #[inline(never)]
 fn accept_or_reject(
     gate0: subtle::Choice,
     gate1: subtle::Choice,
     buffer: &mut [u8],
     out: &mut Result<(), Error>,
 ) {
-    if !bool::from(gate0) {
-        zeroize_slice(buffer);
-        *out = Err(Error::AuthenticationFailed);
-        return;
-    }
-
-    // Fault-injection hardening (opt-in `hardened` feature): a second *recomputed*
-    // check with its own branch, so a single skipped instruction reaches this gate
-    // instead of accepting. `&` and never `&&`: both comparisons always run in the
-    // caller, so the time this takes does not reveal which gate failed. No
-    // `unwrap_u8` and no early exit inside the comparisons -- `bool::from` is the
-    // conversion `subtle` documents for exactly this place (the end of a
-    // verification). What it does and does not defend against: see README "What is
-    // not defended against".
-    #[cfg(feature = "hardened")]
-    if !bool::from(gate1) {
-        zeroize_slice(buffer);
-        *out = Err(Error::AuthenticationFailed);
-        return;
-    }
-
-    // Without the feature the caller passes `gate0` twice, and the parameter is
-    // unused rather than compiled away silently.
-    #[cfg(not(feature = "hardened"))]
-    let _ = gate1;
-
-    *out = Ok(());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decrypt `ciphertext`, verifying the tag.
 ///
 /// Returns the plaintext in a [`Plaintext`] that zeroizes on drop. On failure
 /// returns [`Error::AuthenticationFailed`] and never exposes the unverified
 /// plaintext.
 #[must_use = "the returned plaintext must be handled"]

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (798141) panicked at tests/decision.rs:26:51:
called `Result::unwrap()` on an `Err` value: AuthenticationFailed

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
