*** src/lib.rs:946:33: replace & with ^ in decrypt_in_place_detached

*** mutation diff:
--- src/lib.rs
+++ replace & with ^ in decrypt_in_place_detached
@@ -938,17 +938,17 @@
     let (mut enc_key, mut enc_nonce) = derive_enc(&enc_seed, tag);
 
     chacha20_apply(&enc_key, 0, &enc_nonce, &Input::InPlace, buffer);
 
     let mut computed_tag = derive_tag(&mac_key, key, nonce, aad, buffer);
     #[cfg(feature = "hardened")]
     let gates = (
         computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag),
-        computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag),
+        computed_tag.ct_eq(tag) ^ /* ~ changed by cargo-mutants ~ */ tag.ct_eq(&computed_tag),
     );
     #[cfg(not(feature = "hardened"))]
     let auth_ok = computed_tag.ct_eq(tag);
 
     zeroize_array(&mut mac_key);
     zeroize_array(&mut enc_seed);
     zeroize_array(&mut enc_key);
     // The per-message ChaCha20 nonce is secret-derived too (it comes out of

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (79464) panicked at tests/decision.rs:56:75:
called `Result::unwrap()` on an `Err` value: AuthenticationFailed

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
