*** src/lib.rs:1131:45: replace & with ^ in decrypt

*** mutation diff:
--- src/lib.rs
+++ replace & with ^ in decrypt
@@ -1123,17 +1123,17 @@
         //
         // The volatile re-read is what forbids that merge, and it is here rather
         // than `black_box` on purpose: whether `black_box` defeats CSE is a
         // property of the optimizer's choices, not of the program, and this
         // hardening must not rest on the difference between two compilers.  A
         // volatile access is one the language requires to happen.
         //
         // Cost: two 65-byte copies and two wipes, only under this feature.
-        let first = computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag);
+        let first = computed_tag.ct_eq(tag) ^ /* ~ changed by cargo-mutants ~ */ tag.ct_eq(&computed_tag);
 
         // SAFETY: `computed_tag` is a live local, initialised and aligned for a
         // `[u8; TAG_LEN]` read for the whole statement; nothing writes through the
         // pointer, and a volatile read of live memory has no effect beyond being
         // the read itself.
         let mut computed_tag_copy = unsafe { core::ptr::read_volatile(&computed_tag) };
         // SAFETY: as above, for the caller's reference: `tag` is a live `&[u8;
         // TAG_LEN]` and this only reads through it, so aliasing rules hold.

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (1381845) panicked at tests/decision.rs:26:51:
called `Result::unwrap()` on an `Err` value: AuthenticationFailed

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
