*** src/lib.rs:1246:5: replace decrypt_in_place_detached -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/lib.rs
+++ replace decrypt_in_place_detached -> Result<(), Error> with Ok(())
@@ -1238,79 +1238,17 @@
 /// place. Note this destroys the caller's buffer on the failure path.
 pub fn decrypt_in_place_detached(
     key: &[u8; 32],
     nonce: &[u8; NONCE_LEN],
     aad: &[u8],
     buffer: &mut [u8],
     tag: &[u8; TAG_LEN],
 ) -> Result<(), Error> {
-    check_lengths(buffer.len(), aad.len())?;
-
-    let (mut mac_key, mut enc_seed) = derive_material(key, nonce);
-    let (mut enc_key, mut enc_nonce) = derive_enc(&enc_seed, tag);
-
-    chacha20_apply(&enc_key, 0, &enc_nonce, &Input::InPlace, buffer);
-
-    let mut computed_tag = derive_tag(&mac_key, key, nonce, aad, buffer);
-    #[cfg(feature = "hardened")]
-    let gates = {
-        // See the matching block in `decrypt`: identical reasoning, and the same
-        // volatile re-read, so both entry points get a second gate that is a
-        // recomputation rather than a copy of the first.
-        let first = computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag);
-
-        // SAFETY: `computed_tag` is a live local, initialised and aligned for a
-        // `[u8; TAG_LEN]` read for the whole statement; nothing writes through the
-        // pointer, and a volatile read of live memory has no effect beyond being
-        // the read itself.
-        let mut computed_tag_copy = unsafe { core::ptr::read_volatile(&computed_tag) };
-        // SAFETY: as above, for the caller's reference: `tag` is a live `&[u8;
-        // TAG_LEN]` and this only reads through it, so aliasing rules hold.
-        let mut tag_copy = unsafe { core::ptr::read_volatile(tag) };
-        let second = computed_tag_copy.ct_eq(&tag_copy) & tag_copy.ct_eq(&computed_tag_copy);
-
-        // The copies are secret-derived (they are the computed MAC), so they are
-        // wiped like every other copy in this function rather than left in the
-        // frame of the `hardened` build.
-        zeroize_array(&mut computed_tag_copy);
-        zeroize_array(&mut tag_copy);
-
-        (first, second)
-    };
-    #[cfg(not(feature = "hardened"))]
-    let auth_ok = computed_tag.ct_eq(tag);
-
-    zeroize_array(&mut mac_key);
-    zeroize_array(&mut enc_seed);
-    zeroize_array(&mut enc_key);
-    // The per-message ChaCha20 nonce is secret-derived too (it comes out of
-    // the same XOF call as `enc_key`), so it is wiped with the rest rather
-    // than left on the stack.
-    zeroize_array(&mut enc_nonce);
-    zeroize_array(&mut computed_tag);
-
-    // As in `decrypt`: two rejections written first, and two serial checks, so a fault
-    // that skips the call or corrupts one outcome cannot accept.
-    let mut decision0: Result<(), Error> = Err(Error::AuthenticationFailed);
-    let mut decision1: Result<(), Error> = Err(Error::AuthenticationFailed);
-    #[cfg(not(feature = "hardened"))]
-    accept_or_reject(auth_ok, auth_ok, &mut decision0, &mut decision1);
-    #[cfg(feature = "hardened")]
-    accept_or_reject(gates.0, gates.1, &mut decision0, &mut decision1);
-
-    if decision0.is_err() {
-        zeroize_slice(buffer);
-        return Err(Error::AuthenticationFailed);
-    }
-    if decision1.is_err() {
-        zeroize_slice(buffer);
-        return Err(Error::AuthenticationFailed);
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ── ChaCha20 Primitive ────────────────────────────────────────────────
 
 /// Quarter round: (a, b, c, d) → (a', b', c', d')
 #[inline]
 fn qr(a: u32, b: u32, c: u32, d: u32) -> (u32, u32, u32, u32) {
     let a = a.wrapping_add(b);

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (1387008) panicked at tests/decision.rs:62:9:
forged tag accepted in place at message length 0

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
