*** src/lib.rs:1259:45: replace & with ^ in decrypt_in_place_detached

*** mutation diff:
--- src/lib.rs
+++ replace & with ^ in decrypt_in_place_detached
@@ -1251,17 +1251,17 @@
     chacha20_apply(&enc_key, 0, &enc_nonce, &Input::InPlace, buffer);
 
     let mut computed_tag = derive_tag(&mac_key, key, nonce, aad, buffer);
     #[cfg(feature = "hardened")]
     let gates = {
         // See the matching block in `decrypt`: identical reasoning, and the same
         // volatile re-read, so both entry points get a second gate that is a
         // recomputation rather than a copy of the first.
-        let first = computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag);
+        let first = computed_tag.ct_eq(tag) ^ /* ~ changed by cargo-mutants ~ */ tag.ct_eq(&computed_tag);
 
         // SAFETY: `computed_tag` is a live local, initialised and aligned for a
         // `[u8; TAG_LEN]` read for the whole statement; nothing writes through the
         // pointer, and a volatile read of live memory has no effect beyond being
         // the read itself.
         let mut computed_tag_copy = unsafe { core::ptr::read_volatile(&computed_tag) };
         // SAFETY: as above, for the caller's reference: `tag` is a live `&[u8;
         // TAG_LEN]` and this only reads through it, so aliasing rules hold.

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (1388029) panicked at tests/decision.rs:56:75:
called `Result::unwrap()` on an `Err` value: AuthenticationFailed

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
