*** src/lib.rs:1260:25: replace > with < in decrypt_bounded

*** mutation diff:
--- src/lib.rs
+++ replace > with < in decrypt_bounded
@@ -1252,17 +1252,17 @@
 pub fn decrypt_bounded(
     key: &[u8; 32],
     nonce: &[u8; NONCE_LEN],
     aad: &[u8],
     ciphertext: &[u8],
     tag: &[u8; TAG_LEN],
     max_len: usize,
 ) -> Result<Plaintext, Error> {
-    if ciphertext.len() > max_len {
+    if ciphertext.len() < /* ~ changed by cargo-mutants ~ */ max_len {
         return Err(Error::MessageTooLong);
     }
     decrypt(key, nonce, aad, ciphertext, tag)
 }
 
 /// Decrypt `buffer` in place, verifying the detached tag.
 ///
 /// On failure the buffer is zeroized, so unverified plaintext is never left in

---- decrypt_bounded_enforces_the_callers_limit stdout ----

thread 'decrypt_bounded_enforces_the_callers_limit' (1454033) panicked at tests/security.rs:524:9:
a 0-byte limit must refuse a 43-byte ciphertext

failures:
    decrypt_bounded_enforces_the_callers_limit

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.43s

*** result: Failure(101)
