*** src/lib.rs:916:12: delete ! in decrypt

*** mutation diff:
--- src/lib.rs
+++ delete ! in decrypt
@@ -908,17 +908,17 @@
         // and no early exit inside the comparisons -- `bool::from` is the conversion
         // subtle documents for exactly this place (the end of a verification).
         // What it does and does not defend against: see README "What is not defended
         // against".
         if !bool::from(gates.0) {
             zeroize_slice(&mut plaintext);
             return Err(Error::AuthenticationFailed);
         }
-        if !bool::from(gates.1) {
+        if  /* ~ changed by cargo-mutants ~ */bool::from(gates.1) {
             zeroize_slice(&mut plaintext);
             return Err(Error::AuthenticationFailed);
         }
         Ok(Plaintext(plaintext))
     }
 }
 
 /// Decrypt `buffer` in place, verifying the detached tag.

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (85090) panicked at tests/decision.rs:26:51:
called `Result::unwrap()` on an `Err` value: AuthenticationFailed

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
