*** src/lib.rs:935:5: replace decrypt_in_place_detached -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/lib.rs
+++ replace decrypt_in_place_detached -> Result<(), Error> with Ok(())
@@ -927,69 +927,17 @@
 /// place. Note this destroys the caller's buffer on the failure path.
 pub fn decrypt_in_place_detached(
     key: &[u8; 32],
     nonce: &[u8; NONCE_LEN],
     aad: &[u8],
     buffer: &mut [u8],
     tag: &[u8; TAG_LEN],
 ) -> Result<(), Error> {
-    check_lengths(buffer.len(), aad.len())?;
-
-    let (mut mac_key, mut enc_seed) = derive_material(key, nonce);
-    let (mut enc_key, mut enc_nonce) = derive_enc(&enc_seed, tag);
-
-    chacha20_apply(&enc_key, 0, &enc_nonce, &Input::InPlace, buffer);
-
-    let mut computed_tag = derive_tag(&mac_key, key, nonce, aad, buffer);
-    #[cfg(feature = "hardened")]
-    let gates = (
-        computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag),
-        computed_tag.ct_eq(tag) & tag.ct_eq(&computed_tag),
-    );
-    #[cfg(not(feature = "hardened"))]
-    let auth_ok = computed_tag.ct_eq(tag);
-
-    zeroize_array(&mut mac_key);
-    zeroize_array(&mut enc_seed);
-    zeroize_array(&mut enc_key);
-    // The per-message ChaCha20 nonce is secret-derived too (it comes out of
-    // the same XOF call as `enc_key`), so it is wiped with the rest rather
-    // than left on the stack.
-    zeroize_array(&mut enc_nonce);
-    zeroize_array(&mut computed_tag);
-
-    #[cfg(not(feature = "hardened"))]
-    if bool::from(auth_ok) {
-        Ok(())
-    } else {
-        zeroize_slice(buffer);
-        Err(Error::AuthenticationFailed)
-    }
-
-    #[cfg(feature = "hardened")]
-    {
-        // Fault-injection hardening (opt-in `hardened` feature): two *recomputed*
-        // checks, each with its own branch, so a single skipped instruction reaches the
-        // other gate instead of accepting. `&` and never `&&`: both comparisons always
-        // run, so the time this takes does not reveal which gate failed. No `unwrap_u8`
-        // and no early exit inside the comparisons -- `bool::from` is the conversion
-        // subtle documents for exactly this place (the end of a verification).
-        // What it does and does not defend against: see README "What is not defended
-        // against".
-        if !bool::from(gates.0) {
-            zeroize_slice(buffer);
-            return Err(Error::AuthenticationFailed);
-        }
-        if !bool::from(gates.1) {
-            zeroize_slice(buffer);
-            return Err(Error::AuthenticationFailed);
-        }
-        Ok(())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ── ChaCha20 Primitive ────────────────────────────────────────────────
 
 /// Quarter round: (a, b, c, d) → (a', b', c', d')
 #[inline]
 fn qr(a: u32, b: u32, c: u32, d: u32) -> (u32, u32, u32, u32) {
     let a = a.wrapping_add(b);

---- a_forged_tag_must_not_be_accepted stdout ----

thread 'a_forged_tag_must_not_be_accepted' (85914) panicked at tests/decision.rs:62:9:
forged tag accepted in place at message length 0

failures:
    a_forged_tag_must_not_be_accepted

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
